{"1": {"name": "AVC conditions", "desc": "General conditions of transport 1983, latest revision laid down by the Stichting Vervoeradres The Hague."}, "2": {"name": "Special agreement for parcels transport", "desc": "Appliance of a non published special agreement signed between a customer and the carrier (mandatory requested by the consignor) for parcels transport."}, "3": {"name": "Special agreement for full loading transport", "desc": "Appliance of a non published special agreement signed between a customer and the carrier (mandatory requested by the consignor) for full load transport."}, "4": {"name": "Combined transport", "desc": "A transport which involves more than one mode of transportation."}, "5": {"name": "FIATA combined transport bill of lading", "desc": "Standard conditions of a combined transport bill of lading issued by FIATA."}, "6": {"name": "Freight forwarders national conditions", "desc": "The contract and carriage conditions as established by freight forwarders on a national basis."}, "7": {"name": "Normal tariff, parcels transport", "desc": "Appliance of the published legal tariff in case of parcels transport (required or not by the consignor."}, "8": {"name": "Normal tariff, full loading transport", "desc": "Appliance of the published legal tariff in case of full load transport (required or not by the consignor)."}, "9": {"name": "Ordinary", "desc": "Carrier will choose the cheapest tariff in the legally published tariffs for parcels or full load transports (no tariff required by the consignor)."}, "10": {"name": "Port to port", "desc": "The transport will only be port to port, no inland transport would have to be provided under the contract."}, "11": {"name": "CMR carnet", "desc": "Conditions in accordance with the convention of the contract for the international carriage of goods by road."}, "12": {"name": "Special tariff, parcels transport", "desc": "Appliance of the legally published 'special' tariff in case or parcels transport (tariff requested by the consignor)."}, "13": {"name": "Special tariff, full transport", "desc": "Appliance of the legally published 'special tariff' in case of full load transport (tariff requested by the consignor)."}, "14": {"name": "Through transport", "desc": "The transport that is contracted not only from port to port, but from one inland location to another inland location."}, "15": {"name": "Cancel space allocation", "desc": "Indication that space previously allocated on a flight is to be cancelled."}, "16": {"name": "Report sale of space", "desc": "Indication that a sale has been made against a space allocation on a specific flight."}, "17": {"name": "Alternative space allocation", "desc": "Indication that space is being requested for a specific flight and that an alternative is acceptable."}, "18": {"name": "No alternative space allocation", "desc": "Indication that space is being requested for a specific flight and that an alternative is not acceptable."}, "19": {"name": "Allotment sale", "desc": "Indication that space is being sold against a space allocation allotment on a specific flight."}, "20": {"name": "Confirmation of space", "desc": "Indication that space requested has been confirmed on a specific flight."}, "21": {"name": "Unable to confirm", "desc": "Indication that airline is unable to confirm the space allocation on a specific flight."}, "22": {"name": "Non-operative flight", "desc": "Indication that airline is unable to confirm space on a specific flight since the flight does not operate."}, "23": {"name": "Wait list", "desc": "Indication that the space allocation request has been assigned to a wait list."}, "24": {"name": "Prior space allocation request", "desc": "Indication that a space allocation on a specific flight has already been requested."}, "25": {"name": "Holding confirmed space allocation", "desc": "Indication that space is being held as confirmed on a specific flight."}, "26": {"name": "Holding wait list", "desc": "Indication that space allocation request on a specific flight has been assigned to a wait list."}, "27": {"name": "Door-to-door", "desc": "The carrier is responsible for the intermodal carriage of cargo including both the pre-carriage and the on- carriage."}, "28": {"name": "Door-to-pier", "desc": "The carrier is responsible for the intermodal carriage of cargo including the pre-carriage, but excluding the on-carriage."}, "29": {"name": "Pier-to-door", "desc": "The carrier is responsible for the intermodal carriage of cargo including the on-carriage, but excluding the pre-carriage."}, "30": {"name": "Pier-to-pier", "desc": "The carrier of intermodal cargo is only responsible for the main carriage."}, "31": {"name": "Space cancellation noted", "desc": "Indication that space previously allocated on a means of transport has been cancelled."}, "32": {"name": "Mini landbridge service", "desc": "Cargo moving from a coastal port for delivery at an inland location or cargo received at an inland location moving to a coastal port for subsequent ocean transportation."}, "34": {"name": "Speed level - required", "desc": "Maximum speed required on an itinerary or part of this itinerary to be able to assume some services."}, "35": {"name": "Speed level - adopted", "desc": "Real speed used on an itinerary or part of this itinerary (for technical reasons, some limitation can be imposed or some higher speed could be used)."}, "36": {"name": "Normal tariff, less than full load transport", "desc": "Application of the published legal tariff in case of less than full load transport (required or not by the consignor)."}, "37": {"name": "Re-expedition special tariff", "desc": "Indication that a special tariff must be used in the case of a re-expedition."}, "38": {"name": "Transport arrangement by the requester", "desc": "The service requester has the responsibility of making transport arrangement."}, "39": {"name": "Transport arrangement by the provider", "desc": "The service provider has the responsibility of making transport arrangement."}, "40": {"name": "Transport arrangement by the patient", "desc": "The patient has the responsibility of making transport arrangement."}}
